Revit 2027 API
ElementWorksetFilter.WorksetId Property
 The workset id.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public WorksetId WorksetId { get; }
Public ReadOnly Property WorksetId As WorksetId
	Get
public:
property WorksetId^ WorksetId {
	WorksetId^ get ();
}
member WorksetId : WorksetId with get
Property Value
WorksetId
See Also
Reference
ElementWorksetFilter Class
Autodesk.Revit.DB Namespace